espressif/arduino-esp32/libraries/BluetoothSerial/src/BluetoothSerial.cpp
/** @brief      Stops the asynchronous discovery and clears the callback */
void BluetoothSerial::discoverAsyncStop() {
    esp_bt_gap_cancel_discovery();
    advertisedDeviceCb = nullptr;
}

/** @brief      Clears scanresult entries */
void BluetoothSerial::discoverClear() {
    scanResults.clear();
}

/** @brief      Can be used while discovering asynchronously
 *              Will be returned also on synchronous discovery.
 *
 * @return      BTScanResults contains several information of found devices
 */
BTScanResults* BluetoothSerial::getScanResults() {
    return &scanResults;
}

BluetoothSerial::operator bool() const
{
    return true;
}

/**
 * SDP scan address
 * esp_spp_start_discovery doesn't tell us the btAddress in the callback, so we have to wait until it's finished
 */
std::map<int, std::string> BluetoothSerial::getChannels(const BTAddress &remoteAddress) {
    if(xEventGroupGetBits(_bt_event_group) & BT_SDP_RUNNING) {
        log_e("getChannels failed - already running");
    }
    xEventGroupSetBits(_bt_event_group, BT_SDP_RUNNING);
    xEventGroupClearBits(_bt_event_group, BT_SDP_COMPLETED);
    _doConnect = false;
    sdpRecords.clear();
    log_d("esp_spp_start_discovery");
    if (esp_spp_start_discovery(*remoteAddress.getNative()) != ESP_OK) {
        log_e("esp_spp_start_discovery failed");
    } else {
        if(! waitForSDPRecord(READY_TIMEOUT)) {
            log_e("getChannels failed timeout");
        }
        log_d("esp_spp_start_discovery wait for BT_SDP_COMPLETED done (%dms)", READY_TIMEOUT);
    }
    log_d("esp_spp_start_discovery done, found %d services", sdpRecords.size());
    xEventGroupClearBits(_bt_event_group, BT_SDP_RUNNING);
    return sdpRecords;
}

/**
 * @brief      Gets the MAC address of local BT device in byte array.
 *
 * @param      mac [out]  The mac
 */
void BluetoothSerial::getBtAddress(uint8_t *mac) {
    const uint8_t *dev_mac = esp_bt_dev_get_address();
    memcpy(mac, dev_mac, ESP_BD_ADDR_LEN);
}
/**
 * @brief      Gets the MAC address of local BT device as BTAddress object.
 *
 * @return     The BTAddress object.
 */
BTAddress BluetoothSerial::getBtAddressObject() {
    uint8_t mac_arr[ESP_BD_ADDR_LEN];
    getBtAddress(mac_arr);
    return BTAddress(mac_arr);
}
/**
 * @brief      Gets the MAC address of local BT device as string.
 *
 * @return     The BT MAC address string.
 */
String BluetoothSerial::getBtAddressString() {
    return getBtAddressObject().toString(true);
}

void BluetoothSerial::dropCache(){
    if(!isReady(false, READY_TIMEOUT)){
        log_w("Attempted to drop cache for uninitialized driver. First call begin()");
        return;
    }

    int expected_dev_num = esp_bt_gap_get_bond_device_num();
    if(expected_dev_num == 0){
        log_i("No devices in cache.");
        return;
    }else{
        log_d("Found %d bonded devices", expected_dev_num);
    }
    esp_err_t ret;

    // typedef uint8_t esp_bd_addr_t[ESP_BD_ADDR_LEN] // ESP_BD_ADDR_LEN = 6
    esp_bd_addr_t *dev_list = NULL;
    log_d("Allocate buffer: sizeof(esp_bd_addr_t)=%d * expected_dev_num=%d", sizeof(esp_bd_addr_t), expected_dev_num);
    dev_list = (esp_bd_addr_t*) malloc(sizeof(esp_bd_addr_t) * expected_dev_num);
    if(dev_list == NULL){
        log_e("Could not allocated BT device buffer!");
        return;
    }
    //uint8_t dev_list [20][6];

    int dev_num;
    ret = esp_bt_gap_get_bond_device_list(&dev_num, dev_list);
    log_d("esp_bt_gap_get_bond_device_list ret = %d", ret);
    if(ret == ESP_OK){
        if(dev_num != expected_dev_num){
            log_w("Inconsistent number of bonded devices. Expected %d; returned %d",expected_dev_num, dev_num);
        }
        for(int i=0; i<dev_num; ++i){
            ret = esp_bt_gap_remove_bond_device(dev_list[i]);
            log_d("esp_bt_gap_remove_bond_device ret = %d", ret);
            if(ret == ESP_OK){
                log_d("Removed bonded device #%d", i);
            }else{
                log_w("Failed to removed bonded device #%d", i);
            }
            //btc_storage_remove_bonded_device(dev_list[i]);
        }
        log_d("device num after delete = %d", esp_bt_gap_get_bond_device_num());
    }else{
        log_w("Function esp_bt_gap_get_bond_device_list() returned code %d", ret);
    }
}
#endif // defined(CONFIG_BT_ENABLED) && defined(CONFIG_BLUEDROID_ENABLED)
